### DataFrame - 2
- DataFrame과 DataFrame 연산

In [1]:
import pandas as pd

In [2]:
data = {'A':[98, 78, 100, 52],
        'B':[90, 70, 10, 50]}

In [3]:
df1 = pd.DataFrame(data)
df1

     A   B
0   98  90
1   78  70
2  100  10
3   52  50

In [4]:
df2 = df1 / 4
df2

      A     B
0  24.5  22.5
1  19.5  17.5
2  25.0   2.5
3  13.0  12.5

In [5]:
# 연산 수행
# 산술 연산
df1 + df2

       A      B
0  122.5  112.5
1   97.5   87.5
2  125.0   12.5
3   65.0   62.5

In [6]:
df1 - df2

      A     B
0  73.5  67.5
1  58.5  52.5
2  75.0   7.5
3  39.0  37.5

In [7]:
# 비교 연산
df1 <= df2

       A      B
0  False  False
1  False  False
2  False  False
3  False  False

In [8]:
df1 > df2

      A     B
0  True  True
1  True  True
2  True  True
3  True  True

In [10]:
# DataFrame과 Series 연산
df1['A'] + df2  # 1:1대응이 안 이루어짐

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [12]:
sr1 = df1.A

In [13]:
sr1 + df2

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [18]:
#  첫번째 방법 : sr ==> df
sr1_df = sr1.to_frame()

In [21]:
sr1_df + df2

       A   B
0  122.5 NaN
1   97.5 NaN
2  125.0 NaN
3   65.0 NaN

In [22]:
sr1_df.add(df2, fill_value=0)

       A     B
0  122.5  22.5
1   97.5  17.5
2  125.0   2.5
3   65.0  12.5

In [14]:
# 2번째 방법
df3 = df2.T
sr1 + df3

       0     1      2     3
A  122.5  97.5  125.0  65.0
B  120.5  95.5  102.5  64.5

In [26]:
# 시리즈를 전치 시키는 것도 설명 하신 듯 한데 잘 모르겠음...

In [27]:
# 전치는 shape을 맞춰주는 것